## 1. Counting missing values
<p>In this notebook, we play the role of a product analyst for an online sports clothing company. The company is specifically interested in how it can improve revenue. We will dive into product data such as pricing, reviews, descriptions, and ratings, as well as revenue and website traffic, to produce recommendations for its marketing and sales teams.  </p>
<p>The database provided to us, <code>sports</code>, contains five tables, with <code>product_id</code> being the primary key for all of them: </p>
<h3 id="info"><code>info</code></h3>
<table>
<thead>
<tr>
<th>column</th>
<th>data type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>product_name</code></td>
<td><code>varchar</code></td>
<td>Name of the product</td>
</tr>
<tr>
<td><code>product_id</code></td>
<td><code>varchar</code></td>
<td>Unique ID for product</td>
</tr>
<tr>
<td><code>description</code></td>
<td><code>varchar</code></td>
<td>Description of the product</td>
</tr>
</tbody>
</table>
<h3 id="finance"><code>finance</code></h3>
<table>
<thead>
<tr>
<th>column</th>
<th>data type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>product_id</code></td>
<td><code>varchar</code></td>
<td>Unique ID for product</td>
</tr>
<tr>
<td><code>listing_price</code></td>
<td><code>float</code></td>
<td>Listing price for product</td>
</tr>
<tr>
<td><code>sale_price</code></td>
<td><code>float</code></td>
<td>Price of the product when on sale</td>
</tr>
<tr>
<td><code>discount</code></td>
<td><code>float</code></td>
<td>Discount, as a decimal, applied to the sale price</td>
</tr>
<tr>
<td><code>revenue</code></td>
<td><code>float</code></td>
<td>Amount of revenue generated by each product, in US dollars</td>
</tr>
</tbody>
</table>

<h3 id="reviews"><code>reviews</code></h3>
<table>
<thead>
<tr>
<th>column</th>
<th>data type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>product_name</code></td>
<td><code>varchar</code></td>
<td>Name of the product</td>
</tr>
<tr>
<td><code>product_id</code></td>
<td><code>varchar</code></td>
<td>Unique ID for product</td>
</tr>
<tr>
<td><code>rating</code></td>
<td><code>float</code></td>
<td>Product rating, scored from <code>1.0</code> to <code>5.0</code></td>
</tr>
<tr>
<td><code>reviews</code></td>
<td><code>float</code></td>
<td>Number of reviews for the product</td>
</tr>
</tbody>
</table>
<h3 id="traffic"><code>traffic</code></h3>
<table>
<thead>
<tr>
<th>column</th>
<th>data type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>product_id</code></td>
<td><code>varchar</code></td>
<td>Unique ID for product</td>
</tr>
<tr>
<td><code>last_visited</code></td>
<td><code>timestamp</code></td>
<td>Date and time the product was last viewed on the website</td>
</tr>
</tbody>
</table>
<h3 id="brands"><code>brands</code></h3>
<table>
<thead>
<tr>
<th>column</th>
<th>data type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>product_id</code></td>
<td><code>varchar</code></td>
<td>Unique ID for product</td>
</tr>
<tr>
<td><code>brand</code></td>
<td><code>varchar</code></td>
<td>Brand of the product</td>
</tr>
</tbody>
</table>
<p>We will be dealing with missing data as well as numeric, string, and timestamp data types to draw insights about the products in the online store. Let's start by finding out how complete the data is.</p>

In [107]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('postgresql://postgres:042711@localhost:2705/mei_database')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [108]:
%%sql
DROP VIEW IF EXISTS reviews

 * postgresql://postgres:***@localhost:2705/mei_database
(psycopg2.errors.WrongObjectType) "reviews" is not a view
HINT:  Use DROP TABLE to remove a table.

[SQL: DROP VIEW IF EXISTS reviews]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [109]:
info = pd.read_csv('info_v2.csv')
finance = pd.read_csv('finance.csv')
traffic = pd.read_csv('traffic_v3.csv')
brands = pd.read_csv('brands_v2.csv')
reviews = pd.read_csv('reviews_v2.csv')
info.to_sql('info', engine, if_exists='replace', index=False)
finance.to_sql('finance', engine, if_exists='replace', index=False)
traffic.to_sql('traffic', engine, if_exists='replace', index=False)
brands.to_sql('brands', engine, if_exists='replace', index=False)
reviews.to_sql('reviews', engine, if_exists='replace', index=False)

In [110]:
%%sql
ALTER TABLE traffic
ALTER COLUMN last_visited TYPE timestamp
USING last_visited::timestamp without time zone

 * postgresql://postgres:***@localhost:2705/mei_database
Done.

[]

# TASK 1: check how complete the data is

In [111]:
%%sql

-- Count all columns as total_rows
-- Count the number of non-missing entries for description, listing_price, and last_visited
-- Join info, finance, and traffic

SELECT count(*) AS total_rows, 
       count(info.description) AS count_description, 
       count(finance.listing_price) AS count_listing_price, 
       count(traffic.last_visited) AS count_last_visited
FROM info
JOIN finance USING (product_id)
JOIN traffic USING (product_id);

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(3179, 3117, 3120, 2928)]

# Task 2: how listing_price varies between Adidas and Nike products
examine the distribution & count by price

In [112]:
%%sql
SELECT brand, listing_price::int, count(finance.product_id)
FROM brands
INNER JOIN finance
USING(product_id)
WHERE listing_price > 0
GROUP BY brand, listing_price
ORDER BY listing_price DESC
LIMIT 3

 * postgresql://postgres:***@localhost:2705/mei_database
3 rows affected.

[('Adidas', 300, 2), ('Adidas', 280, 4), ('Adidas', 240, 5)]

In [113]:
%%sql
SELECT listing_price::int, count(product_id)
FROM finance
WHERE listing_price > 0
GROUP BY listing_price
ORDER BY listing_price
LIMIT 5

 * postgresql://postgres:***@localhost:2705/mei_database
5 rows affected.

[(9, 1), (10, 11), (12, 1), (13, 27), (15, 27)]

# Task 3: Labeling price ranges
Create labels for products grouped by price range and brand.

In [114]:
%%sql
SELECT brand, count(finance.*), 
    sum(revenue) AS total_revenue,
    CASE WHEN listing_price < 42 THEN 'Budget'
        WHEN listing_price < 74 THEN 'Average'
        WHEN listing_price < 129 THEN 'Expensive'
        ELSE 'Elite' END AS price_category

FROM brands
INNER JOIN finance
USING(product_id)
WHERE brand IS NOT NULL 
GROUP BY brand, price_category
ORDER BY total_revenue DESC

 * postgresql://postgres:***@localhost:2705/mei_database
8 rows affected.

[('Adidas', 849, 4626980.069999998, 'Expensive'),
 ('Adidas', 1060, 3233661.0599999987, 'Average'),
 ('Adidas', 307, 3014316.830000001, 'Elite'),
 ('Adidas', 359, 651661.1199999999, 'Budget'),
 ('Nike', 357, 595341.0199999999, 'Budget'),
 ('Nike', 82, 128475.58999999997, 'Elite'),
 ('Nike', 90, 71843.15, 'Expensive'),
 ('Nike', 16, 6623.499999999999, 'Average')]

In [115]:
%%sql
SELECT current_user; 
SELECT inet_server_addr();

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.
1 rows affected.

[('::1',)]

In [116]:
import psycopg2
# Connect to the PostgreSQL database
conn = psycopg2.connect(
    host = "localhost",
    port = 2705,
    database="mei_database",
    user="postgres",
    password="042711")

writer = pd.ExcelWriter('compare.xlsx', engine = 'xlsxwriter')
df = pd.read_sql("SELECT brand, count(finance.*),      sum(revenue) AS total_revenue,     CASE WHEN listing_price < 42 THEN 'budget'         WHEN listing_price < 74 THEN 'Average'         WHEN listing_price < 129 THEN 'Expensive'         ELSE 'Elite' END AS price_category  FROM brands INNER JOIN finance USING(product_id) WHERE brand IS NOT NULL  GROUP BY brand, price_category ORDER BY total_revenue DESC ", conn) 
df.to_excel(writer, sheet_name='sheet_1', index=False)
df1 = pd.read_sql("SELECT b.brand, COUNT(f.*), SUM(f.revenue) as total_revenue, CASE WHEN f.listing_price < 42 THEN 'Budget'     WHEN f.listing_price >= 42 AND f.listing_price < 74 THEN 'Average'     WHEN f.listing_price >= 74 AND f.listing_price < 129 THEN 'Expensive'     ELSE 'Elite' END AS price_category FROM finance AS f INNER JOIN brands AS b      ON f.product_id = b.product_id WHERE b.brand IS NOT NULL GROUP BY b.brand, price_category ORDER BY total_revenue DESC;", conn)
df1.to_excel(writer, sheet_name='sheet_2', index=False)
writer.save()
conn.close()

# Task 4: Average discount by brand
identify whether there is a difference in the amount of discount offered between brands, as this could be influencing revenue

In [117]:
%%sql

SELECT brand, count(finance.*), 
    sum(revenue) AS total_revenue,
    avg(discount),
    CASE WHEN listing_price < 42 THEN 'Budget'
        WHEN listing_price < 74 THEN 'Average'
        WHEN listing_price < 129 THEN 'Expensive'
        ELSE 'Elite' END AS price_category

FROM brands
INNER JOIN finance
USING(product_id)
WHERE brand IS NOT NULL 
GROUP BY brand, price_category
ORDER BY total_revenue DESC

 * postgresql://postgres:***@localhost:2705/mei_database
8 rows affected.

[('Adidas', 849, 4626980.069999998, 0.3247349823321567, 'Expensive'),
 ('Adidas', 1060, 3233661.0599999987, 0.36962264150943, 'Average'),
 ('Adidas', 307, 3014316.830000001, 0.2885993485342019, 'Elite'),
 ('Adidas', 359, 651661.1199999999, 0.29331476323119865, 'Budget'),
 ('Nike', 357, 595341.0199999999, 0.0, 'Budget'),
 ('Nike', 82, 128475.58999999997, 0.0, 'Elite'),
 ('Nike', 90, 71843.15, 0.0, 'Expensive'),
 ('Nike', 16, 6623.499999999999, 0.0, 'Average')]

In [118]:
%%sql
SELECT brand, avg(discount)*100 || '%' AS average_discount
FROM brands
INNER JOIN finance
USING(product_id)
GROUP BY brand
HAVING brand IS NOT NULL

 * postgresql://postgres:***@localhost:2705/mei_database
2 rows affected.

[('Adidas', '33.45242718446526%'), ('Nike', '0%')]

# Task 5: Correlation between revenue and reviews

In [119]:
%%sql
SELECT corr(revenue, reviews)
FROM finance
INNER JOIN reviews
USING (product_id)

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(0.6518512283481296,)]

# Task 6: Ratings and reviews by product description length

In [120]:
%%sql
SELECT TRUNC(length(description) /100) * 100 AS description_length, round(avg(rating::numeric), 2) AS average_rating, round(avg(reviews::numeric), 2) AS avg_reviews
FROM info
INNER JOIN reviews
USING(product_id)
WHERE description IS NOT NULL
GROUP BY description_length
ORDER BY description_length
LIMIT 10

 * postgresql://postgres:***@localhost:2705/mei_database
7 rows affected.

[(0.0, Decimal('1.87'), Decimal('4.00')),
 (100.0, Decimal('3.21'), Decimal('33.00')),
 (200.0, Decimal('3.27'), Decimal('42.68')),
 (300.0, Decimal('3.29'), Decimal('44.52')),
 (400.0, Decimal('3.32'), Decimal('42.69')),
 (500.0, Decimal('3.12'), Decimal('56.80')),
 (600.0, Decimal('3.65'), Decimal('54.53'))]

In [121]:
%%sql
WITH exam_corr AS(
    SELECT TRUNC(length(description) /100) * 100 AS description_length, round(avg(rating::numeric), 2) AS average_rating
        FROM info
        INNER JOIN reviews
        USING(product_id)
        WHERE description IS NOT NULL
        GROUP BY description_length
        ORDER BY description_length
)
SELECT corr(description_length, average_rating)
FROM exam_corr

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(0.7066864470096965,)]

In [122]:
%%sql
SELECT corr(length(description), rating)
FROM info
INNER JOIN reviews
USING(product_id)
WHERE description IS NOT NULL

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(0.028826791510493353,)]

# Task 7: Reviews by month and brand
As we know a correlation exists between reviews and revenue, one approach the company could take is to run experiments with different sales processes encouraging more reviews from customers about their purchases, such as by offering a small discount on future purchases.

Let's take a look at the volume of reviews by month to see if there are any trends or gaps we can look to exploit.

In [123]:
%%sql
SELECT brand, date_part('month', last_visited) AS month, count(reviews) as num_reviews
FROM brands
INNER JOIN traffic
USING (product_id) 
INNER JOIN reviews
USING (product_id)
WHERE date_part('year', last_visited) != 2020
GROUP BY brand, month
HAVING brand IS NOT NULL AND date_part('month', last_visited) IS NOT NULL
ORDER BY brand, month

 * postgresql://postgres:***@localhost:2705/mei_database
24 rows affected.

[('Adidas', 1.0, 163),
 ('Adidas', 2.0, 173),
 ('Adidas', 3.0, 178),
 ('Adidas', 4.0, 151),
 ('Adidas', 5.0, 172),
 ('Adidas', 6.0, 159),
 ('Adidas', 7.0, 170),
 ('Adidas', 8.0, 189),
 ('Adidas', 9.0, 181),
 ('Adidas', 10.0, 192),
 ('Adidas', 11.0, 150),
 ('Adidas', 12.0, 190),
 ('Nike', 1.0, 32),
 ('Nike', 2.0, 33),
 ('Nike', 3.0, 39),
 ('Nike', 4.0, 33),
 ('Nike', 5.0, 41),
 ('Nike', 6.0, 43),
 ('Nike', 7.0, 37),
 ('Nike', 8.0, 29),
 ('Nike', 9.0, 28),
 ('Nike', 10.0, 47),
 ('Nike', 11.0, 38),
 ('Nike', 12.0, 35)]

In [124]:
%%sql
select min(LAST_VISITED), max(LAST_VISITED)
from traffic

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(datetime.datetime(2018, 1, 1, 0, 0), datetime.datetime(2020, 4, 12, 19, 0))]

# Task 8+9:     Product Performance

In [126]:
%%sql

-- Create the footwear CTE, containing description and revenue
-- Filter footwear for products with a description containing %shoe%, %trainer, or %foot%
-- Also filter for products that are not missing values for description
-- Calculate the number of products and median revenue for footwear products

WITH footwear AS(
    SELECT description, revenue
    FROM info 
    INNER JOIN finance 
    USING (product_id)
    WHERE (description ILIKE '%shoe%' OR description ILIKE '%trainer%' OR description ILIKE '%foot%') AND description IS NOT NULL)

SELECT COUNT(*) AS num_footwear_products, PERCENTILE_DISC(0.5) WITHIN GROUP (ORDER BY revenue) AS median_footwear_revenue
FROM footwear

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(2193, 3598.56)]

In [131]:
%%sql
WITH footwear AS(
    SELECT description, revenue
    FROM info 
    INNER JOIN finance 
    USING (product_id)
    WHERE (description NOT ILIKE '%shoe%' AND description NOT ILIKE '%trainer%' AND description NOT ILIKE '%foot%') AND description IS NOT NULL)

SELECT COUNT(*) AS num_clothing_products, PERCENTILE_DISC(0.5) WITHIN GROUP (ORDER BY revenue) AS median_clothing_revenue
FROM footwear

 * postgresql://postgres:***@localhost:2705/mei_database
1 rows affected.

[(417, 503.82)]